#+TITLE: Intro To Comp Thinking Week 9 Tutorial
#+AUTHOR: Hankertrix
#+STARTUP: showeverything
#+OPTIONS: toc:2

* Question 4
#+begin_src python :results output
def output(message, times = 1):
    print(message*times)
output("Computational Thinking")
output("Very easy", 3)
#+end_src

#+RESULTS:
: Computational Thinking
: Very easyVery easyVery easy


* Question 5
#+begin_src python :results output
a = 1
b = 2
c = 3
d = 123.4

def add(a, b, c=4):
    global d
    a += b
    b += 1
    d += a
    print(a, b, c)
    return a+b+c

for i in range(1, 4):
    a = add(i, b)
    print(a, b, c)
print(d)
#+end_src

#+RESULTS:
: 3 3 4
: 10 2 3
: 4 3 4
: 11 2 3
: 5 3 4
: 12 2 3
: 135.4

With ~global d~ removed:
#+begin_src python
UnboundLocalError: cannot access local variable 'd' where it is not associated with a value
#+end_src


* Question 6
#+begin_src python :results output
def checkmarks(marks, passes):
    for i in range(len(marks)):
        if 47 <= marks[i] < 50:
            marks[i] = 50
            passes += 1

marklist = [44, 68, 56, 98, 47, 28, 88, 75, 49, 66]

passes = 6
checkmarks(marklist, passes)

print("New mark list: ", marklist)
print("The new number of passes: ", passes)
#+end_src

#+RESULTS:
: New mark list:  [44, 68, 56, 98, 50, 28, 88, 75, 50, 66]
: The new number of passes:  6

